In [2]:
# Imported required libraries for the cleaning .
import pandas as pd
import numpy as np 
import matplotlib.pyplot as plt
import seaborn as sns

In [ ]:
df = pd.read_csv('Messy_Employee_dataset.csv') # Imported the dataset.

In [ ]:
df.shape # Quickly checked the dataset dimensions so we get an overall idea of the size of the data we are dealing with.

(1020, 12)

In [1]:
df # Skim the dataset.

NameError: name 'df' is not defined

In [309]:
df.sample(5)

,Employee_ID,First_Name,Last_Name,Age,Department_Region,Status,Join_Date,Salary,Email,Phone,Performance_Score,Remote_Work
578,EMP1578,Bob,Johnson,30.0,DevOps-Nevada,Active,11/6/2024,97978.36,bob.johnson@example.com,-5580996131,Poor,True
234,EMP1234,Heidi,Brown,25.0,Admin-Texas,Active,5/13/2024,95161.40,heidi.brown@example.com,-5182606887,Excellent,False
839,EMP1839,Charlie,Jones,35.0,DevOps-New York,Inactive,1/5/2021,105956.04,charlie.jones@example.com,-7123166006,Excellent,False
991,EMP1991,Heidi,Brown,NaN,Admin-Texas,Pending,12/11/2023,86135.69,heidi.brown@example.com,-2341903105,Excellent,False
220,EMP1220,Charlie,Williams,25.0,Sales-California,Active,12/13/2022,88085.74,charlie.williams@example.com,-5528993159,Excellent,True

In [310]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1020 entries, 0 to 1019
Data columns (total 12 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Employee_ID        1020 non-null   object
 1   First_Name         1020 non-null   object
 2   Last_Name          1020 non-null   object
 3   Age                809 non-null    float64
 4   Department_Region  1020 non-null   object
 5   Status             1020 non-null   object
 6   Join_Date          1020 non-null   object
 7   Salary             996 non-null    float64
 8   Email              1020 non-null   object
 9   Phone              1020 non-null   int64
 10  Performance_Score  1020 non-null   object
 11  Remote_Work        1020 non-null   bool
dtypes: bool(1), float64(2), int64(1), object(8)
memory usage: 88.8+ KB

In [311]:
df.isna().sum()

Employee_ID            0
First_Name             0
Last_Name              0
Age                  211
Department_Region      0
Status                 0
Join_Date              0
Salary                24
Email                  0
Phone                  0
Performance_Score      0
Remote_Work            0
dtype: int64

In [312]:
df['Age'].unique()

array([25., nan, 40., 30., 35.])

In [313]:
df['Department'] = df['Department_Region'].str.split('-').str[0]
df['Region'] = df['Department_Region'].str.split('-').str[1]

In [ ]:
df['Phone'] = df['Phone'].astype(str).str.replace("-","",regex=False)

In [ ]:
df['Join_Date'] = pd.to_datetime(df['Join_Date'])

In [316]:
df['Remote_Work'] =  df['Remote_Work'].astype(int)

In [317]:
df['Performance_Score'].unique()

array(['Average', 'Excellent', 'Good', 'Poor'], dtype=object)

In [318]:
perfo_map = {
    'Average' : 2 ,
    'Excellent' : 4,
    'Good' : 3,
    'Poor' : 1 
}

In [319]:
df['Performance_Score'] = df['Performance_Score'].map(perfo_map)

In [320]:
from sklearn.preprocessing import OneHotEncoder

In [321]:
onc = OneHotEncoder(sparse_output=False,handle_unknown='ignore')

In [ ]:
df['Status'] = onc.fit_transform(df[['Status']]).astype(int)

In [323]:
df

,Employee_ID,First_Name,Last_Name,Age,Department_Region,Status,Join_Date,Salary,Email,Phone,Performance_Score,Remote_Work,Department,Region
0,EMP1000,Bob,Davis,25.0,DevOps-California,1,2021-04-02,59767.65,bob.davis@example.com,1651623197,2,1,DevOps,California
1,EMP1001,Bob,Brown,NaN,Finance-Texas,1,2020-07-10,65304.66,bob.brown@example.com,1898471390,4,1,Finance,Texas
2,EMP1002,Alice,Jones,NaN,Admin-Nevada,0,2023-12-07,88145.90,alice.jones@example.com,5596363211,3,1,Admin,Nevada
3,EMP1003,Eva,Davis,25.0,Admin-Nevada,0,2021-11-27,69450.99,eva.davis@example.com,3476490784,3,1,Admin,Nevada
4,EMP1004,Frank,Williams,25.0,Cloud Tech-Florida,1,2022-01-05,109324.61,frank.williams@example.com,1586734256,1,0,Cloud Tech,Florida
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1015,EMP2015,David,Miller,30.0,HR-California,1,2023-08-19,NaN,david.miller@example.com,3546212759,3,1,HR,California
1016,EMP2016,David,Johnson,30.0,Cloud Tech-Texas,0,2021-11-07,100215.06,david.johnson@example.com,2508261122,3,1,Cloud Tech,Texas
1017,EMP2017,Charlie,Williams,40.0,Finance-New York,1,2023-10-04,114587.11,charlie.williams@example.com,1261632487,2,0,Finance,New York
1018,EMP2018,Alice,Garcia,30.0,HR-Florida,0,2024-12-16,71318.79,alice.garcia@example.com,8995729892,3,1,HR,Florida
1019,EMP2019,Heidi,Jones,30.0,DevOps-Illinois,0,2021-02-22,77764.24,heidi.jones@example.com,7629745492,2,0,DevOps,Illinois

In [324]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1020 entries, 0 to 1019
Data columns (total 14 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Employee_ID        1020 non-null   object
 1   First_Name         1020 non-null   object
 2   Last_Name          1020 non-null   object
 3   Age                809 non-null    float64
 4   Department_Region  1020 non-null   object
 5   Status             1020 non-null   int64
 6   Join_Date          1020 non-null   datetime64[ns]
 7   Salary             996 non-null    float64
 8   Email              1020 non-null   object
 9   Phone              1020 non-null   object
 10  Performance_Score  1020 non-null   int64
 11  Remote_Work        1020 non-null   int64
 12  Department         1020 non-null   object
 13  Region             1020 non-null   object
dtypes: datetime64[ns](1), float64(2), int64(3), object(8)
memory usage: 111.7+ KB

In [325]:
df.columns

Index(['Employee_ID', 'First_Name', 'Last_Name', 'Age', 'Department_Region',
       'Status', 'Join_Date', 'Salary', 'Email', 'Phone', 'Performance_Score',
       'Remote_Work', 'Department', 'Region'],
      dtype='object')

In [ ]:
df['Join_Year'] = df['Join_Date'].dt.year

In [ ]:
df1 = df[:]
df = df.drop(columns=['Department_Region'])

In [ ]:
X = df.drop(columns=['Employee_ID', 'First_Name', 'Last_Name', 'Email', 'Phone', 'Join_Date'])

In [ ]:
X.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1020 entries, 0 to 1019
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Age                809 non-null    float64
 1   Status             1020 non-null   int64
 2   Salary             996 non-null    float64
 3   Performance_Score  1020 non-null   int64
 4   Remote_Work        1020 non-null   int64
 5   Department         1020 non-null   object
 6   Region             1020 non-null   object
 7   Join_Year          1020 non-null   int32
dtypes: float64(2), int32(1), int64(3), object(2)
memory usage: 59.9+ KB

In [330]:
onc = OneHotEncoder(sparse_output=False,handle_unknown='ignore')

In [ ]:
X_dept_encoded = onc.fit_transform(df[['Department','Region']])

In [ ]:
X_dept_encoded_cols = onc.get_feature_names_out(['Department','Region'])

In [ ]:
X_dept = pd.DataFrame(X_dept_encoded,columns=X_dept_encoded_cols)

In [334]:
X_dept

,Department_Admin,Department_Cloud Tech,Department_DevOps,Department_Finance,Department_HR,Department_Sales,Region_California,Region_Florida,Region_Illinois,Region_Nevada,Region_New York,Region_Texas
0,0.0,0.0,1.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0
1,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0
2,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0
3,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0
4,0.0,1.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...
1015,0.0,0.0,0.0,0.0,1.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0
1016,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0
1017,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0
1018,0.0,0.0,0.0,0.0,1.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0
1019,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0

In [ ]:
X = X.drop(columns=['Department','Region'])

In [ ]:
X = pd.concat([X,X_dept],axis=1)

In [337]:
X

,Age,Status,Salary,Performance_Score,Remote_Work,Join_Year,Department_Admin,Department_Cloud Tech,Department_DevOps,Department_Finance,Department_HR,Department_Sales,Region_California,Region_Florida,Region_Illinois,Region_Nevada,Region_New York,Region_Texas
0,25.0,1,59767.65,2,1,2021,0.0,0.0,1.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0
1,NaN,1,65304.66,4,1,2020,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0
2,NaN,0,88145.90,3,1,2023,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0
3,25.0,0,69450.99,3,1,2021,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0
4,25.0,1,109324.61,1,0,2022,0.0,1.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1015,30.0,1,NaN,3,1,2023,0.0,0.0,0.0,0.0,1.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0
1016,30.0,0,100215.06,3,1,2021,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0
1017,40.0,1,114587.11,2,0,2023,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0
1018,30.0,0,71318.79,3,1,2024,0.0,0.0,0.0,0.0,1.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0
1019,30.0,0,77764.24,2,0,2021,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0

In [338]:
X.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1020 entries, 0 to 1019
Data columns (total 18 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Age                    809 non-null    float64
 1   Status                 1020 non-null   int64
 2   Salary                 996 non-null    float64
 3   Performance_Score      1020 non-null   int64
 4   Remote_Work            1020 non-null   int64
 5   Join_Year              1020 non-null   int32
 6   Department_Admin       1020 non-null   float64
 7   Department_Cloud Tech  1020 non-null   float64
 8   Department_DevOps      1020 non-null   float64
 9   Department_Finance     1020 non-null   float64
 10  Department_HR          1020 non-null   float64
 11  Department_Sales       1020 non-null   float64
 12  Region_California      1020 non-null   float64
 13  Region_Florida         1020 non-null   float64
 14  Region_Illinois        1020 non-null   float64
 15  Region_Nevada          1020 non-null   float64
 16  Region_New York        1020 non-null   float64
 17  Region_Texas           1020 non-null   float64
dtypes: float64(14), int32(1), int64(3)
memory usage: 139.6 KB

In [339]:
from sklearn.preprocessing import StandardScaler

In [ ]:
scaler = StandardScaler()

In [ ]:
X_scalled = scaler.fit_transform(X)

In [ ]:
from sklearn.impute import KNNImputer

In [ ]:
knn = KNNImputer(n_neighbors=5,weights='distance')

In [ ]:
knn_arr = knn.fit_transform(X_scalled)

In [ ]:
knn_arr = scaler.inverse_transform(knn_arr)

In [ ]:
imputed = pd.DataFrame(knn_arr,columns=X.columns)

In [352]:
imputed['Age'] = imputed['Age'].round()

In [353]:
imputed

,Age,Status,Salary,Performance_Score,Remote_Work,Join_Year,Department_Admin,Department_Cloud Tech,Department_DevOps,Department_Finance,Department_HR,Department_Sales,Region_California,Region_Florida,Region_Illinois,Region_Nevada,Region_New York,Region_Texas
0,25.0,1.0,59767.650000,2.0,1.0,2021.0,0.0,0.0,1.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0
1,31.0,1.0,65304.660000,4.0,1.0,2020.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0
2,33.0,0.0,88145.900000,3.0,1.0,2023.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0
3,25.0,0.0,69450.990000,3.0,1.0,2021.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0
4,25.0,1.0,109324.610000,1.0,0.0,2022.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1015,30.0,1.0,85628.995756,3.0,1.0,2023.0,0.0,0.0,0.0,0.0,1.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0
1016,30.0,0.0,100215.060000,3.0,1.0,2021.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0
1017,40.0,1.0,114587.110000,2.0,0.0,2023.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0
1018,30.0,0.0,71318.790000,3.0,1.0,2024.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0
1019,30.0,0.0,77764.240000,2.0,0.0,2021.0,0.0,0.0,1.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0,0.0,0.0

In [354]:
df

,Employee_ID,First_Name,Last_Name,Age,Status,Join_Date,Salary,Email,Phone,Performance_Score,Remote_Work,Department,Region,Join_Year
0,EMP1000,Bob,Davis,25.0,1,2021-04-02,59767.65,bob.davis@example.com,1651623197,2,1,DevOps,California,2021
1,EMP1001,Bob,Brown,NaN,1,2020-07-10,65304.66,bob.brown@example.com,1898471390,4,1,Finance,Texas,2020
2,EMP1002,Alice,Jones,NaN,0,2023-12-07,88145.90,alice.jones@example.com,5596363211,3,1,Admin,Nevada,2023
3,EMP1003,Eva,Davis,25.0,0,2021-11-27,69450.99,eva.davis@example.com,3476490784,3,1,Admin,Nevada,2021
4,EMP1004,Frank,Williams,25.0,1,2022-01-05,109324.61,frank.williams@example.com,1586734256,1,0,Cloud Tech,Florida,2022
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1015,EMP2015,David,Miller,30.0,1,2023-08-19,NaN,david.miller@example.com,3546212759,3,1,HR,California,2023
1016,EMP2016,David,Johnson,30.0,0,2021-11-07,100215.06,david.johnson@example.com,2508261122,3,1,Cloud Tech,Texas,2021
1017,EMP2017,Charlie,Williams,40.0,1,2023-10-04,114587.11,charlie.williams@example.com,1261632487,2,0,Finance,New York,2023
1018,EMP2018,Alice,Garcia,30.0,0,2024-12-16,71318.79,alice.garcia@example.com,8995729892,3,1,HR,Florida,2024
1019,EMP2019,Heidi,Jones,30.0,0,2021-02-22,77764.24,heidi.jones@example.com,7629745492,2,0,DevOps,Illinois,2021

In [356]:
df.drop(columns=['Join_Year'],inplace=True)

In [366]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1020 entries, 0 to 1019
Data columns (total 13 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Employee_ID        1020 non-null   object
 1   First_Name         1020 non-null   object
 2   Last_Name          1020 non-null   object
 3   Department         1020 non-null   object
 4   Region             1020 non-null   object
 5   Age                1020 non-null   float64
 6   Status             1020 non-null   int64
 7   Join_Date          1020 non-null   datetime64[ns]
 8   Salary             1020 non-null   float64
 9   Email              1020 non-null   object
 10  Phone              1020 non-null   object
 11  Performance_Score  1020 non-null   int64
 12  Remote_Work        1020 non-null   int64
dtypes: datetime64[ns](1), float64(2), int64(3), object(7)
memory usage: 103.7+ KB

In [358]:
df['Age'] = imputed['Age']
df['Salary'] = imputed['Salary']

In [360]:
df.isnull().sum()

Employee_ID          0
First_Name           0
Last_Name            0
Age                  0
Status               0
Join_Date            0
Salary               0
Email                0
Phone                0
Performance_Score    0
Remote_Work          0
Department           0
Region               0
dtype: int64

In [361]:
df.columns

Index(['Employee_ID', 'First_Name', 'Last_Name', 'Age', 'Status', 'Join_Date',
       'Salary', 'Email', 'Phone', 'Performance_Score', 'Remote_Work',
       'Department', 'Region'],
      dtype='object')

In [363]:
new_order = ['Employee_ID', 'First_Name', 'Last_Name',
       'Department', 'Region' ,'Age', 'Status', 'Join_Date',
       'Salary', 'Email', 'Phone', 'Performance_Score', 'Remote_Work']

In [364]:
df = df[new_order]

In [365]:
df

,Employee_ID,First_Name,Last_Name,Department,Region,Age,Status,Join_Date,Salary,Email,Phone,Performance_Score,Remote_Work
0,EMP1000,Bob,Davis,DevOps,California,25.0,1,2021-04-02,59767.650000,bob.davis@example.com,1651623197,2,1
1,EMP1001,Bob,Brown,Finance,Texas,31.0,1,2020-07-10,65304.660000,bob.brown@example.com,1898471390,4,1
2,EMP1002,Alice,Jones,Admin,Nevada,33.0,0,2023-12-07,88145.900000,alice.jones@example.com,5596363211,3,1
3,EMP1003,Eva,Davis,Admin,Nevada,25.0,0,2021-11-27,69450.990000,eva.davis@example.com,3476490784,3,1
4,EMP1004,Frank,Williams,Cloud Tech,Florida,25.0,1,2022-01-05,109324.610000,frank.williams@example.com,1586734256,1,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
1015,EMP2015,David,Miller,HR,California,30.0,1,2023-08-19,85628.995756,david.miller@example.com,3546212759,3,1
1016,EMP2016,David,Johnson,Cloud Tech,Texas,30.0,0,2021-11-07,100215.060000,david.johnson@example.com,2508261122,3,1
1017,EMP2017,Charlie,Williams,Finance,New York,40.0,1,2023-10-04,114587.110000,charlie.williams@example.com,1261632487,2,0
1018,EMP2018,Alice,Garcia,HR,Florida,30.0,0,2024-12-16,71318.790000,alice.garcia@example.com,8995729892,3,1
1019,EMP2019,Heidi,Jones,DevOps,Illinois,30.0,0,2021-02-22,77764.240000,heidi.jones@example.com,7629745492,2,0

In [367]:
df.to_csv('cleaned_Messy_Employee_dataset.csv')